DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories) VALUES
  (100000, '2019-05-30 10:00:00', 'Завтрак', 500),
  (100000, '2019-05-30 14:00:00', 'Обед', 1010),
  (100000, '2019-05-30 19:00:00', 'Ужин', 500),
  (100000, '2019-05-31 09:00:00', 'Кашка', 600),
  (100000, '2019-05-31 13:00:00', 'Суп, котлеты, компот', 1400),
  (100000, '2019-05-31 21:00:00', 'Кефир', 50),
  (100000, '2019-06-01 10:00:00', 'Завтрак', 500),
  (100000, '2019-06-01 13:30:55', 'Обед', 500),
  (100000, '2019-06-01 20:00:00', 'Ужин', 800),
  (100001, '2019-05-30 08:00:00', 'Завтрак админа', 500),
  (100001, '2019-05-30 14:00:00', 'Обед админа', 1100),
  (100001, '2019-05-30 21:30:35', 'Ужин', 500),
  (100001, default, 'Еда', 500);